<?php
require 'Music.php'; 

$CUTSTRING = new Music();  

$DATA_MUSIC = 'ใจ ฉันเคยถูกทิ้งเพียงลำพัง รักใครมาแล้วตั้งกี่ครั้ง
ผิดหวังมากี่หน เมื่อรักคนที่เขาไม่ได้รักเราก็ช้ำใจอย่างนี้
สุดท้ายต้องโดนเขามองผ่าน สุดท้ายไม่มีใครต้องการ
ไม่รู้นานแค่ไหน จะได้จากใครสักที

แค่อยากเป็นคนที่ถูกรัก แค่อยากเป็นคนที่ถูกใครสักคนเข้าใจ
ช่วยเติมชีวิตที่ว่างเปล่า ช่วยเอาความรักมาให้ มีใครบ้างไหมสักคน

เธอ แล้วเธอกับฉันก็เจอกัน ความหวังมีอีกครั้งในใจฉัน
เจ็บช้ำมาอย่างนั้น แต่ฉันยังจะขอลองอีกสักทีจะร้ายดีอย่างไร
สุดท้ายถ้าเธอนั้นมองผ่าน ถ้าฉันไม่มีใครต้องการ
อย่างน้อยมันก็คุ้ม จะทุ่มเทให้มันรู้ไป

แค่อยากเป็นคนที่ถูกรัก แค่อยากเป็นคนที่ถูกใครสักคนเข้าใจ
ช่วยเติมชีวิตที่ว่างเปล่า ช่วยเอาความรักมาให้ มีใครบ้างไหมสักคน

แค่อยากเป็นคนที่เธอรัก แค่อยากเป็นคนที่เธอนั้นจะมาเข้าใจ
แค่สบตาฉันแล้วช่วยตอบ ว่าเธอจะรักกันได้ ได้อย่างที่ฉันรักเธอ

แค่อยากเป็นคนที่ถูกรัก อยากเป็นแค่ใครสักคนที่มีความหมาย
ช่วยเติมชีวิตที่ว่างเปล่า ช่วยเอาความรักมาให้ มีใครบ้างไหมสักคน

แค่อยากเป็นคนที่เธอรัก แค่อยากเป็นคนที่เธอนั้นจะมาเข้าใจ
แค่สบตาฉันแล้วช่วยตอบ ว่าเธอจะรักกันได้ ได้อย่างที่ฉันรักเธอ

ช่วยบอกกับฉันได้ไหม เธอ';


echo "เนื้อเพลง : " .$DATA_MUSIC;
echo "<hr>";
$CUT_DATA = $CUTSTRING->processText($DATA_MUSIC);
echo "<hr>";
echo $CUT_DATA ;
echo "<hr>";
$MUSIC_STRING =   json_decode($CUT_DATA);
echo "<pre>";
print_r($MUSIC_STRING);
echo count($MUSIC_STRING);
 ?>